In [1]:
import pandas as pd

In [2]:
df = pd.read_html('http://sos.ga.gov/elections/election_results/2008_0715/02202.htm')

In [3]:
df = df[1]

In [4]:
df.shape

(8, 35)

In [5]:
df.head(5)

,0,1,2,3,4,5,6,7,8,9,...,25,26,27,28,29,30,31,32,33,34
0,"U.S. Representative, District 6 Democratic 100...",NaN,NaN,NaN,"Jones 10,920","Totals 10,920",NaN,NaN,NaN,100.0%,...,DEKALB,24.0,24.0,3150.0,3150.0,FULTON,109.0,109.0,3557.0,3557.0
1,NaN,NaN,NaN,"Jones 10,920","Totals 10,920",NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,100.0%,100.0%,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,County,PR,TP,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,CHEROKEE,46,46,1596,1596,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [6]:
df = df[4:]

In [7]:
df.head(5)

,0,1,2,3,4,5,6,7,8,9,...,25,26,27,28,29,30,31,32,33,34
4,CHEROKEE,46,46,1596,1596,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,COBB,63,63,2617,2617,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,DEKALB,24,24,3150,3150,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7,FULTON,109,109,3557,3557,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [8]:
df = df[df.columns[[0,3]]]

In [9]:
df.head(5)

          0     3
4  CHEROKEE  1596
5      COBB  2617
6    DEKALB  3150
7    FULTON  3557

In [10]:
df.columns = ['county', 'Bill Jones']

In [11]:
df.tail(5)

     county Bill Jones
4  CHEROKEE       1596
5      COBB       2617
6    DEKALB       3150
7    FULTON       3557

In [12]:
df = df.melt(id_vars=['county'])

In [13]:
df.columns = ['county', 'candidate', 'votes']

In [14]:
df.head()

     county   candidate votes
0  CHEROKEE  Bill Jones  1596
1      COBB  Bill Jones  2617
2    DEKALB  Bill Jones  3150
3    FULTON  Bill Jones  3557

In [15]:
df['votes'] = df['votes'].astype(int)

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
county       4 non-null object
candidate    4 non-null object
votes        4 non-null int64
dtypes: int64(1), object(2)
memory usage: 176.0+ bytes

In [17]:
df['office'] = 'U.S. Representative'

In [18]:
df['district'] = '6'

In [19]:
df['party'] = 'Democrat'

In [20]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate   party
Bill Jones  Democrat    10920
Name: votes, dtype: int64

In [21]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

     county               office district     party   candidate  votes
0  CHEROKEE  U.S. Representative        6  Democrat  Bill Jones   1596
1      COBB  U.S. Representative        6  Democrat  Bill Jones   2617
2    DEKALB  U.S. Representative        6  Democrat  Bill Jones   3150
3    FULTON  U.S. Representative        6  Democrat  Bill Jones   3557

In [22]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')